/*********************************************
兔子生崽问题（古典问题）：有一对兔子，从出生后第三个月起每月都生一对兔子，小兔子长到第三个月起后每个月又生一对兔子，
假如兔子都不死，问每个月的兔子总数为多少？(输出前40个月即可) 
*********************************************/

/*********************************************
思路：数学建模，找出数学规律，兔子总数按月份依次为：1,1,2,3,5,8，从第三个月开始，后一个月是前两个月之和，递归求解
*********************************************/

#include <stdio.h>

int main(){
    long int a =1, b = 1;
    int i;
    printf("%ld,%ld,",a,b);

    for(i=0;i<40;i++){
        a = a+b;
        b = b+a;
        printf("%ld,%ld,",a,b);
    }

    return 0;
}