/*****************************
水仙花数：打印出所有的水仙花数，水仙花数是指一个三位数，其各位数字立方和等于该数本身。
例如：153 = 1*1*1 + 5*5*5 + 3*3*3
*****************************/

/*****************************
思路：遍历所有三位数，取出每一位数字，求其立方和，判断是否等于该数本身。
*****************************/

#include <stdio.h>

int main(){

    int i,ge,shi,bai,sum;

    for(i=100;i<=999;i++){
        ge = i%10;
        shi = i/10%10;
        bai = i/100;
        sum = ge*ge*ge + shi*shi*shi + bai*bai*bai;
        if(sum ==i){
            printf("%d\n",i);
        }
    }
}
