/*
猴子吃桃问题：猴子第一天摘了若干个桃子，当即吃了一半，还不够，又多吃了一个，第二天早上又将剩下的桃子吃掉一半，
又多吃了一个，以后每天早上都吃了前一天剩下一半零一个
到第10天早上想再吃时，见只剩下一个桃子了
求第一天共摘了多少个桃子
视频思路：
    1.循环。for(start;end;++)   while(x<0)
    2.x1    x2=(x1/2)-1     x3=(x2/2)-1
    ...     x9=(x8/2)-1    x10=(x9/2)-1
            x10=1          x9=(x10+1)*2  x8=(x9+1)*2
我的思路：
    1.x0 = ?, x1 = x0/2-1, x2 = x2/2-1, ..., x8 = x7/2-1, x9 = x8/2-1, x10 = x9/2-1=1
    2.x10 = 1, x9 = (x10+1)*2=4, x8 = (x9+1)*2=10,..., x0 = (x1+1)*2
    3.变量x=1, 每倒推一天x = (x+1)*2, 一共倒推10次,for(i=10;i>=0;i--){},
*/

#include<stdio.h>

int main(){
    int i,x;
    i = 0;
    x = 1;

    for(i=10;i>0;i--){
        printf("第%d天剩余%d个桃子\n",i,x);
        x = (x+1)*2;
    }
    printf("最开始摘了%d个桃子",x);

    return 0;
}

