/*一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少，
完全平方数是指一个数是另外一个整数数的平方的数*/
/*思路
一个整数x，x+100 = m^2, x+100+168=n^2.要求取x
m*m-100 = n*n-268，通过这个式子限制出m，n的范围，再代入反解x
n*n - m*m = 168
(n+m)*(n-m)=168
令i=n+m,j=n-m,
那么i*j=168, i+j=2n, i-j=2m,
那么i+j为偶数，i-j也为偶数，=> i，j同奇偶，i*j=168 => i,j同偶数且i>2,j>2,i<168/2,j<84
然后只需要遍历（2,84），找出ij，进而找出mn，最后得到x
*/

#include<stdio.h>
int main()
{
    int x,m,n,i,j,p;

    for(i=2;i<85;i=i+2){
        for(j=2;j<85;j=j+2){
            p = i*j;
            if(p == 168){
                m = (i-j)/2;
                n = (i+j)/2;
                x = m*m - 100;
                printf("i=%d, j=%d\n",i,j);
                printf("m=%d,n=%d\n",m,n);
                printf("x=%d\n",x);
                //x = n*n - 168
            }
        }
    }

    return 0;
}